In [6]:
import pandas as pd

data = {
    "Name" : ["홍길동", "임꺽정", "성춘향"],
    "Age" : [25, None, 20],
    "City" : ["서울", "부산", None],
}
df = pd.DataFrame(data)
print(df)
print(df.isnull())

  Name   Age  City
0  홍길동  25.0    서울
1  임꺽정   NaN    부산
2  성춘향  20.0  None
    Name    Age   City
0  False  False  False
1  False   True  False
2  False  False   True

In [ ]:
# 결측값 개수 확인
df.isnull().sum()

Name    0
Age     1
City    1
dtype: int64

In [8]:
df.info()

<class 'pandas.core.frame.DataFrame'>
RangeIndex: 3 entries, 0 to 2
Data columns (total 3 columns):
 #   Column  Non-Null Count  Dtype
---  ------  --------------  -----
 0   Name    3 non-null      object
 1   Age     2 non-null      float64
 2   City    2 non-null      object
dtypes: float64(1), object(2)
memory usage: 204.0+ bytes

In [10]:
# 결측값 있는 행 모두 삭제
df_drop_row = df.dropna()
df_drop_row

  Name   Age City
0  홍길동  25.0   서울

In [ ]:
# 결측값 있는 열 모두 삭제
df_drop_col = df.dropna(axis=1)
df_drop_col

  Name
0  홍길동
1  임꺽정
2  성춘향

In [12]:
df_fillna = df.fillna(0)
df_fillna

  Name   Age City
0  홍길동  25.0   서울
1  임꺽정   0.0   부산
2  성춘향  20.0    0

In [ ]:
# 결측치 : 이전행의 값으로 대체 (method="ffill")
# 첫 행의 결측값은 결측값으로 그대로 남게 됨
df_fill_f = df.fillna(method="ffill")
df_fill_f

C:\Users\praye\AppData\Local\Temp\ipykernel_361764\806544568.py:1: FutureWarning: DataFrame.fillna with 'method' is deprecated and will raise in a future version. Use obj.ffill() or obj.bfill() instead.
  df_fill_f = df.fillna(method="ffill")

  Name   Age City
0  홍길동  25.0   서울
1  임꺽정  25.0   부산
2  성춘향  20.0   부산

In [ ]:
# 결측치 : 다음행의 값으로 대체 (method="bfill")
# 마지막 행의 결측값은 결측값으로 그대로 남게 됨
df_fill_b = df.fillna(method="bfill")
df_fill_b

C:\Users\praye\AppData\Local\Temp\ipykernel_361764\486926472.py:2: FutureWarning: DataFrame.fillna with 'method' is deprecated and will raise in a future version. Use obj.ffill() or obj.bfill() instead.
  df_fill_b = df.fillna(method="bfill")

  Name   Age  City
0  홍길동  25.0    서울
1  임꺽정  20.0    부산
2  성춘향  20.0  None

In [ ]:
# .isin() 메서드 /w Series ㅡ 결측값은 무시됨
s = pd.Series(["홍길동", "임꺽정", "성춘향", "이몽룡", None])
result = s.isin(["홍길동", "이몽룡"])
result

0     True
1    False
2    False
3     True
4    False
dtype: bool

In [ ]:
# .isin() 메서드 /w DataFrame ㅡ 결측값은 무시됨
data = {
    "Name" : ["홍길동", "임꺽정", "성춘향", "이몽룡"],
    "Age" : [None, 30, 20, 32]
}
df = pd.DataFrame(data)
df.isin(["성춘향", "홍길동", 30, 32])

    Name    Age
0   True  False
1  False   True
2   True  False
3  False   True

In [ ]:
df.isin([None])     # 결측값을 무시하기에 None을 찾아주진 않는다

    Name    Age
0  False  False
1  False  False
2  False  False
3  False  False